CSI API ETABS v1
cPropArea.Count Method
 Returns the total number of defined area properties in the model. If desired, counts can be returned for all area properties of a specified type in the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Count(
	int PropType = 0
)
Function Count (
	Optional PropType As Integer = 0
) As Integer
Dim instance As cPropArea
Dim PropType As Integer
Dim returnValue As Integer
returnValue = instance.Count(PropType)
int Count(
	int PropType = 0
)
abstract Count :
        ?PropType : int
(* Defaults:
        let _PropType = defaultArg PropType 0
*)
-> int
Parameters
PropType (Optional)
Type: System.Int32
This optional value is 0, 1, 2 or 3, indicating the type of area properties included in the count.
Value | Type
0 | All
1 | Shell
2 | Plane
3 | Asolid
Return Value
Type: Int32
The total number of defined area properties in the model.
Remarks
Plane and Asolid area properties are not supported in ETABS.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Count as Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'return number of defined area properties of all types
       Count = SapModel.PropArea.Count
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace